<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"dev","backend":"00c692e326f3b1ae5ffd3b342d1be44fe08036df2b1d1f9315aad3190f3fc482","plan_job_ref":"Job Pull Request Checks #4855 at https://github.com/GSA-TTS/FAC/actions/runs/15928005744","plan_out_hash":"5f180b8e9dc2d9b92d637ff6821157cb5d589c19fd63cde9e994de433681f02c","plan_hash":"7b24f0315ae114fb2c9a95f20f9332ecaf39b17437fcb007e291f71ad4c8d700","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan for __dev__
<details>
<summary>Plan: 3 to add, 10 to change, 3 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.dev.cloudfoundry_network_policy.app-network-policy will be updated in-place
!~  resource "cloudfoundry_network_policy" "app-network-policy" {
!~      policies = [
!~          {
!~              destination_app = "caa8e542-9d7e-438d-a17c-3af19b05eaa6" -> (known after apply)
#                (3 unchanged attributes hidden)
            },
#            (2 unchanged elements hidden)
        ]
    }

  # module.dev.cloudfoundry_network_policy.clamav-network-policy will be updated in-place
!~  resource "cloudfoundry_network_policy" "clamav-network-policy" {
!~      policies = [
!~          {
!~              destination_app = "caa8e542-9d7e-438d-a17c-3af19b05eaa6" -> (known after apply)
#                (3 unchanged attributes hidden)
            },
!~          {
!~              destination_app = "caa8e542-9d7e-438d-a17c-3af19b05eaa6" -> (known after apply)
#                (3 unchanged attributes hidden)
            },
        ]
    }

  # module.dev.cloudfoundry_network_policy.logshipper-network-policy will be updated in-place
!~  resource "cloudfoundry_network_policy" "logshipper-network-policy" {
!~      policies = [
!~          {
!~              destination_app = "caa8e542-9d7e-438d-a17c-3af19b05eaa6" -> (known after apply)
!~              source_app      = "92483ac7-d368-43b0-b429-0170e3e2b2c2" -> (known after apply)
#                (2 unchanged attributes hidden)
            },
        ]
    }

  # module.dev.cloudfoundry_network_policy.scanner-network-policy will be updated in-place
!~  resource "cloudfoundry_network_policy" "scanner-network-policy" {
!~      policies = [
!~          {
!~              destination_app = "caa8e542-9d7e-438d-a17c-3af19b05eaa6" -> (known after apply)
!~              source_app      = "a0669f56-c5a5-4c35-85bf-5b6201478ad5" -> (known after apply)
#                (2 unchanged attributes hidden)
            },
!~          {
!~              source_app      = "a0669f56-c5a5-4c35-85bf-5b6201478ad5" -> (known after apply)
#                (3 unchanged attributes hidden)
            },
        ]
    }

  # module.dev.module.cg-logshipper.cloudfoundry_app.logshipper_app will be updated in-place
!~  resource "cloudfoundry_app" "logshipper_app" {
!~      created_at                  = "2025-04-21T18:47:16Z" -> (known after apply)
!~      enable_ssh                  = false -> (known after apply)
!~      id                          = "************************************" -> (known after apply)
!~      log_rate_limit_per_second   = "-1" -> (known after apply)
        name                        = "logshipper"
!~      readiness_health_check_type = "process" -> (known after apply)
!~      routes                      = [
-           {
-               protocol = "http1" -> null
-               route    = "fac-dev-logshipper.app.cloud.gov" -> null
            },
        ] -> (known after apply)
!~      source_code_hash            = "28f7a0bda5e5ef3edbd3f5a6308c42703bb9d2bff793be4acee0c0dae9887158" -> "cea07b634f9038be3326e23871256811b9bfa56cd12cd424bbf22b8695c5414f"
!~      stack                       = "cflinuxfs4" -> (known after apply)
!~      updated_at                  = "2025-06-26T13:30:52Z" -> (known after apply)
#        (12 unchanged attributes hidden)
    }

  # module.dev.module.cg-logshipper.cloudfoundry_route.logshipper_route will be updated in-place
!~  resource "cloudfoundry_route" "logshipper_route" {
!~      destinations = [
-           {
-               app_id           = "92483ac7-d368-43b0-b429-0170e3e2b2c2" -> null
-               app_process_type = "web" -> null
-               id               = "cb430c0b-be04-428f-b94f-0af6d42d100b" -> null
-               port             = 8080 -> null
-               protocol         = "http1" -> null
            },
+           {
+               app_id           = (known after apply)
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
        id           = "3aec8f3f-c16b-4528-bc10-021921a7c5c6"
!~      updated_at   = "2025-04-21T18:49:17Z" -> (known after apply)
#        (6 unchanged attributes hidden)
    }

  # module.dev.module.cors.null_resource.cors_header must be replaced
-/+ resource "null_resource" "cors_header" {
!~      id       = "******************" -> (known after apply)
!~      triggers = { # forces replacement
!~          "always_run" = "2025-06-26T13:22:02Z" -> (known after apply)
        }
    }

  # module.dev.module.fac-file-scanner.data.cloudfoundry_domain.internal will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudfoundry_domain" "internal" {
+       annotations         = (known after apply)
+       created_at          = (known after apply)
+       id                  = (known after apply)
+       internal            = (known after apply)
+       labels              = (known after apply)
+       name                = "apps.internal"
+       org                 = (known after apply)
+       router_group        = (known after apply)
+       shared_orgs         = (known after apply)
+       supported_protocols = (known after apply)
+       updated_at          = (known after apply)
    }

  # module.dev.module.fac-file-scanner.data.external.scannerzip will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "scannerzip" {
+       id          = (known after apply)
+       program     = [
+           "/bin/sh",
+           "prepare-scanner.sh",
        ]
+       query       = {
+           "gitref" = "refs/heads/main"
        }
+       result      = (known after apply)
+       working_dir = "../shared/modules/scanner"
    }

  # module.dev.module.fac-file-scanner.cloudfoundry_app.scanner_app will be updated in-place
!~  resource "cloudfoundry_app" "scanner_app" {
!~      created_at                  = "2025-04-21T18:53:54Z" -> (known after apply)
!~      enable_ssh                  = false -> (known after apply)
!~      id                          = "************************************" -> (known after apply)
!~      log_rate_limit_per_second   = "-1" -> (known after apply)
        name                        = "fac-file-scanner"
!~      path                        = "../shared/modules/scanner/scanner.zip" -> (known after apply)
!~      readiness_health_check_type = "process" -> (known after apply)
!~      routes                      = [
-           {
-               protocol = "http1" -> null
-               route    = "fac-file-scanner-dev.apps.internal" -> null
            },
        ] -> (known after apply)
!~      source_code_hash            = "00ad5f5ebd6a9375c5ee2f56becc6685b67b9840e35a7085d7ab8457f47f7cda" -> (known after apply)
!~      stack                       = "cflinuxfs4" -> (known after apply)
!~      updated_at                  = "2025-06-26T13:24:47Z" -> (known after apply)
#        (11 unchanged attributes hidden)
    }

  # module.dev.module.fac-file-scanner.cloudfoundry_route.scanner_route must be replaced
-/+ resource "cloudfoundry_route" "scanner_route" {
!~      created_at   = "2025-06-26T13:24:47Z" -> (known after apply)
!~      destinations = [
-           {
-               app_id           = "a0669f56-c5a5-4c35-85bf-5b6201478ad5" -> null
-               app_process_type = "web" -> null
-               id               = "e326fece-e2d4-47d0-b70f-eb59c31cd526" -> null
-               port             = 8080 -> null
-               protocol         = "http1" -> null
            },
+           {
+               app_id           = (known after apply)
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
!~      domain       = "26df58ef-0c0d-4997-b68b-8defb7b3998b" -> (known after apply) # forces replacement
!~      id           = "************************************" -> (known after apply)
!~      protocol     = "http" -> (known after apply)
!~      updated_at   = "2025-06-26T13:24:47Z" -> (known after apply)
!~      url          = "fac-file-scanner-dev.apps.internal" -> (known after apply)
#        (2 unchanged attributes hidden)
    }

  # module.dev.module.https-proxy.cloudfoundry_app.egress_app will be updated in-place
!~  resource "cloudfoundry_app" "egress_app" {
!~      created_at                  = "2025-04-21T18:44:40Z" -> (known after apply)
!~      disk_quota                  = "2048M" -> (known after apply)
!~      enable_ssh                  = false -> (known after apply)
!~      health_check_type           = "port" -> (known after apply)
!~      id                          = "************************************" -> (known after apply)
!~      log_rate_limit_per_second   = "-1" -> (known after apply)
        name                        = "https-proxy"
!~      readiness_health_check_type = "process" -> (known after apply)
!~      routes                      = [
-           {
-               protocol = "http1" -> null
-               route    = "gsa-tts-oros-fac-dev-egress-https-proxy.apps.internal" -> null
            },
        ] -> (known after apply)
!~      source_code_hash            = "813c6a5e67dfa23721669eb59be25d14b664d44f322bb20dcc3eb1db32814e84" -> "16790bf86a560f780365920494820fac86b0243b49eae0dbe0cfb0b0a57f50c9"
!~      stack                       = "cflinuxfs4" -> (known after apply)
!~      updated_at                  = "2025-06-26T13:30:42Z" -> (known after apply)
#        (9 unchanged attributes hidden)
    }

  # module.dev.module.https-proxy.cloudfoundry_route.egress_route will be updated in-place
!~  resource "cloudfoundry_route" "egress_route" {
!~      destinations = [
-           {
-               app_id           = "caa8e542-9d7e-438d-a17c-3af19b05eaa6" -> null
-               app_process_type = "web" -> null
-               id               = "2bf104be-d294-4864-a5e1-49d08e420a04" -> null
-               port             = 8080 -> null
-               protocol         = "http1" -> null
            },
+           {
+               app_id           = (known after apply)
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
        id           = "13dc80b5-4d3b-4181-b7c1-b6dc8d5a0e65"
!~      updated_at   = "2025-04-21T18:44:56Z" -> (known after apply)
#        (6 unchanged attributes hidden)
    }

  # module.dev.module.fac-file-scanner.module.quarantine.data.cloudfoundry_service_plans.s3 will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudfoundry_service_plans" "s3" {
+       name                  = "basic"
+       service_offering_name = "s3"
+       service_plans         = (known after apply)
    }

  # module.dev.module.fac-file-scanner.module.quarantine.cloudfoundry_service_instance.bucket will be updated in-place
!~  resource "cloudfoundry_service_instance" "bucket" {
+       dashboard_url     = (known after apply)
        id                = "c435cb9c-32a7-4a31-828b-48c8c6f3bf37"
!~      last_operation    = {
!~          created_at  = "2025-03-14T14:22:42Z" -> (known after apply)
+           description = (known after apply)
!~          state       = "succeeded" -> (known after apply)
!~          type        = "update" -> (known after apply)
!~          updated_at  = "2025-03-14T14:22:42Z" -> (known after apply)
        } -> (known after apply)
!~      maintenance_info  = {
+           description = (known after apply)
+           version     = (known after apply)
        } -> (known after apply)
        name              = "fac-file-scanner-quarantine"
!~      service_plan      = "021bb2a3-7e11-4fc2-b06b-d9f5938cd806" -> (known after apply)
        tags              = [
            "s3",
            "terraform-cloudgov-managed",
        ]
!~      updated_at        = "2025-03-14T14:22:42Z" -> (known after apply)
!~      upgrade_available = false -> (known after apply)
#        (3 unchanged attributes hidden)
    }

  # module.dev.module.file_scanner_clamav.module.route.data.cloudfoundry_domain.domain will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudfoundry_domain" "domain" {
+       annotations         = (known after apply)
+       created_at          = (known after apply)
+       id                  = (known after apply)
+       internal            = (known after apply)
+       labels              = (known after apply)
+       name                = "apps.internal"
+       org                 = (known after apply)
+       router_group        = (known after apply)
+       shared_orgs         = (known after apply)
+       supported_protocols = (known after apply)
+       updated_at          = (known after apply)
    }

  # module.dev.module.file_scanner_clamav.module.route.data.cloudfoundry_org.org will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudfoundry_org" "org" {
+       annotations = (known after apply)
+       created_at  = (known after apply)
+       id          = (known after apply)
+       labels      = (known after apply)
+       name        = "gsa-tts-oros-fac"
+       quota       = (known after apply)
+       suspended   = (known after apply)
+       updated_at  = (known after apply)
    }

  # module.dev.module.file_scanner_clamav.module.route.data.cloudfoundry_space.space will be read during apply
  # (config refers to values not yet known)
 <= data "cloudfoundry_space" "space" {
+       allow_ssh         = (known after apply)
+       annotations       = (known after apply)
+       created_at        = (known after apply)
+       id                = (known after apply)
+       isolation_segment = (known after apply)
+       labels            = (known after apply)
+       name              = "dev"
+       org               = (known after apply)
+       quota             = (known after apply)
+       updated_at        = (known after apply)
    }

  # module.dev.module.file_scanner_clamav.module.route.cloudfoundry_route.app_route must be replaced
-/+ resource "cloudfoundry_route" "app_route" {
!~      created_at   = "2025-06-26T13:24:48Z" -> (known after apply)
!~      destinations = [
-           {
-               app_id           = "6eab89ac-271f-4193-893f-cfa1f590f3d9" -> null
-               app_process_type = "web" -> null
-               id               = "126d1ee1-5c69-49e5-b614-960a9c22bd19" -> null
-               port             = 8080 -> null
-               protocol         = "http1" -> null
            },
+           {
+               app_id           = "************************************"
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
!~      domain       = "26df58ef-0c0d-4997-b68b-8defb7b3998b" -> (known after apply) # forces replacement
!~      id           = "************************************" -> (known after apply)
!~      protocol     = "http" -> (known after apply)
!~      space        = "06525ba3-19c2-451b-96e9-ea4a9134e8b9" -> (known after apply) # forces replacement
!~      updated_at   = "2025-06-26T13:24:48Z" -> (known after apply)
!~      url          = "fac-av-dev-fs.apps.internal" -> (known after apply)
#        (1 unchanged attribute hidden)
    }

Plan: 3 to add, 10 to change, 3 to destroy.
```
</details>

:memo: Plan generated in [Pull Request Checks #4855](https://github.com/GSA-TTS/FAC/actions/runs/15928005744)